#ifndef __INC_ERROR_H__
#define __INC_ERROR_H__
/************************************************************/ 
#define	 UL  0
#define	 UK  1
/************************************************************
*功能说明:  
*          错误检测
*           
************************************************************/ 
#if (UK == 0)
  #error  "错误:UK 必须为 1。不能为 0 "
#endif
#if (UL == 1)
  #error  "错误:UL 必须为 0。不能为 1 "
#endif
/************************************************************
*函数名:	   E22_E23配置
*功能说明:   
************************************************************/
//--------------------------------------------------------
#define FLA_MAX    6	   //E23 火焰6档
//--------------------------------------------------------
#define MAC_ERROT  (EF_II033P_UL_EN1 + EF_II033P_UK_EN2 + L2320_EN + SP2622_UL_EN)
//--------------------------------------------------------
#if (MAC_ERROT > 1 || MAC_ERROT==0)
	 //-------------------
     #define   DWL_EN       1	  //除能顶灯
	 #define   FC_EN        UL    //1 : UK  0 : UL	        
	 #define   ER_CON       1	  // 线温检测：ER_CON ： 1 ：有 ， 0 : 无 
	 //-------------------	 
	#if( MAC_ERROT > 1)
	 //-------------------
	 #error  "错误:你不能同时选择033.UL或UK,你只能选择其中的一种......"
	 //-------------------
	#else
	 //-------------------
	  #error  "错误:你没有选择机型....."
	  //-------------------
	#endif
#endif
/***********************************************************************
*			 
*			           带线检测
*
***********************************************************************/
  #if (EF_II033P_UL_EN1 == 1)	  //EF033GRA_UK
    //--------------------------------------------------------
    #define   DWL_EN        1	 //除能顶灯 
    #define   FC_EN         UL   //1 : UK  0 : UL
//    #define   ER_CON        1	 // 线温检测：ER_CON ： 1 ：有 ， 0 : 无
  #endif
  
  #if (EF_II033P_UK_EN2 == 1)	  //EF033GRA_UL																		
      //--------------------------------------------------------
    #define   DWL_EN        1	   //除能顶灯
    #define   FC_EN         UK   //1 : UK  0 : UL
    #define   ER_CON        0	   // 线温检测：ER_CON ： 1 ：有 ， 0 : 无
  #endif		  	    			  
	  //-------------------	  //EF033GRA_UL	
  #if (L2320_EN == 1)	  //EF033GRA_UL	
   //--------------------------------------------------------
    #define   DWL_EN        0	 //除能顶灯 
    #define   FC_EN         UL   //1 : UK  0 : UL
//    #define   ER_CON        1	 // 线温检测：ER_CON ： 1 ：有 ， 0 : 无
  #endif
  //-------------------	  //EF033GRA_UL	
  #if (SP2622_UL_EN == 1)	  //EF033GRA_UL	
   //--------------------------------------------------------
    #define   DWL_EN        0	 //除能顶灯 
    #define   FC_EN         UL   //1 : UK  0 : UL
//    #define   ER_CON        1	 // 线温检测：ER_CON ： 1 ：有 ， 0 : 无
  #endif
/************************************************************
*
*        
*         
************************************************************/
#define FAN_DELAY_TIME  29  // II310控温 “风机”延时30秒
#define MOT_SPEED  19
#define MOT2_4	   1	  // MOT2_4  = 0 : 2相电机
						  // MOT2_4  = 1 : 4相电机
//-------------------
#define USE_MOT    1	  // USE_MOT = 0 : 正转
                          // USE_MOT = 1 : 反转
//------------------
//---------------
#endif