/***********************************************************
*  文件说明：
************************************************************
*  日期:
*
*  作者:
*
************************************************************
*  硬件：sh79f083
************************************************************
* 【版权】 Copyright(C)鹏林电子
* 【声明】
***********************************************************/
#include "HARDWARE\main\SysInc.h"
//---------------
bit Standby;
//---------------
void PowerKey(void)
{
  Standby = ~Standby;
  if(Standby)
  Specify_Volume();
  else
  Music_stop();
  if(!FlaGears && !HeatOnOff)
  FlaGears = 5;
  KeySaveDat();
}