/***********************************************************
*
************************************************************
*  日期:
*
*  作者:
*
************************************************************
*  硬件：SH79F083
************************************************************
* 【版权】 Copyright(C)鹏林电子
* 【声明】
***********************************************************/
#include "HARDWARE/main/SysInc.h"


void UpKey(void)
{
  if (KeyAct == K2_HEA){
	TempSetKey();
  }
  if(KeyAct == K2_TIM){
    TimerUp();
  }
#if (LUM_EN==1)
  if (KeyAct == K2_FLA || KeyAct == K2_FAO){
    FlaAutoKey();
  }
  if(KeyAct & K2_DOW || KeyAct == K2_DAO){
	DowAutoKey();
  }
#endif
}